In [1]:
#Importando as bibliotecas
import pandas as pd  
import numpy as np  
import matplotlib.pyplot as plt  
import seaborn as sns
from sklearn.model_selection import train_test_split 
from sklearn.linear_model import LinearRegression
from sklearn import metrics
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [9]:
#Importando os dados
df = pd.read_csv('dados.csv')

#Visualizando tabela dos dados
df.head()

   UF  Sexo  Idade  Cor  Anos de Estudo  Renda    Altura
0  11     0     23    8              12    800  1.603808
1  11     1     23    2              12   1150  1.739790
2  11     1     35    8              15    880  1.760444
3  11     0     46    2               6   3500  1.783158
4  11     1     47    8               9    150  1.690631

In [10]:
df = df.drop(['UF','Sexo', 'Idade', 'Cor', 'Altura'], axis=1) 
df = df.rename(columns={'Anos de Estudo': 'anos','Renda':'renda'})

In [15]:
df.head()

   anos  renda
0    12    800
1    12   1150
2    15    880
3     6   3500
4     9    150

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76840 entries, 0 to 76839
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   anos    76840 non-null  int64
 1   renda   76840 non-null  int64
dtypes: int64(2)
memory usage: 1.2 MB

In [38]:
df['produto'] = df['anos'] * df['renda']
df['quadrado']  = df['renda'].pow(2)
n = 76840
SOMA_XY = df['produto'].sum()
SOMA_X = df['renda'].sum()
SOMA_X2 = df['quadrado'].sum()
MEDIA_X = df['renda'].mean()
MEDIA_Y = df['anos'].mean()
df.head()

   anos  renda  produto  quadrado
0    12    800     9600    640000
1    12   1150    13800   1322500
2    15    880    13200    774400
3     6   3500    21000  12250000
4     9    150     1350     22500

In [41]:
NUMERADOR = (n * SOMA_XY) - SOMA_XY
NUMERADOR

141434035680861

In [42]:
DENOMINADOR = n * SOMA_X2 - (SOMA_X * SOMA_X)
DENOMINADOR

65212535285883775

In [43]:
B1 = NUMERADOR / DENOMINADOR
B1

0.002168816701587072

In [44]:
B0 = MEDIA_Y - B1 * MEDIA_X
B0

5.131199746125985

In [ ]:
#RENDA = 5.1311 + 0.003*idade